[
    {
      "date":"2023",
      "title":"Virgil van Dijk fumes at persistent problem as Jurgen Klopp left bemused in Liverpool defeat",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"After the highs against Manchester United last weekend, Liverpool came crashing back down to earth at Bournemouth. Philip Billing's goal was enough to win it as the Cherries condemned the Reds to their eighth defeat of the Premier League campaign and gave Jurgen Klopp a major setback in his aims of finishing in the top four. Advertisement But you knew all of that, of course. What you might have missed were a series of subplots at the Vitality Stadium on Saturday lunchtime. PAUL GORST: Liverpool nightmare leaves players facing accusation they've never dealt with before IAN DOYLE: What Jurgen Klopp said to Liverpool players before Bournemouth defeat raises concerning question Van Dijk fumes Not the first time this season, Virgil van Dijk was left to direct his ire at the officials for the delaying of their offside flag. It's a staple of officiating in the Premier League these days but that certainly hasn't made it any more palatable for the Liverpool defender, who was furious at one particular incident in the first half. After chasing back to deny Dango Ouattara from getting a shot on target, the raising of the offside flag left Van Dijk incensed after around 21 minutes.d to have raped a woman back in 2011 following a high profile civil court case in Scotland. He left the Scottish side Raith Rovers last year after his signing prompted outcry.Goodwillie appeared for the Bury side on Tuesday night (February 8) and scored a hat-trick against rival team, Belper. His signing wasn't formally announced by the club.READ MORE: Damaged wheel on jet burst into flames after landing at Manchester AirportBut less than 24 hours after his first game, the club confirmed he had subsequently left, saying: Our due diligence should have been of a much higher standard.In a statement released on Wednesday morning, the club said: We can confirm that David Goodwillie has left the Club.As a Club we have always been about second chances and have been a part of many players and staff members rehabilitation along that journey, we've always given people a chance to improve their life and found support in this endeavour.ending cost them dearly as Brentford claimed another famous scalp with a 3-1 victory. An Ibrahima Konate own goal and Yoane Wissa’s header put the Bees in control, prompting angry Reds boss Jurgen Klopp to substitute key defender Virgil van Dijk at half-time. Alex Oxlade-Chamberlain pulled one back but Bryan Mbeumo killed the Reds off as they lost more ground in the race for a top-four Premier League finish. It was a case of no Ivan Toney, no problem for Brentford as Liverpool went the same way as Manchester United and Manchester City this season. Despite Thomas Frank’s upbeat assessment of the injury which forced Toney off on a stretcher at West Ham three days earlier, the Bees’ 13-goal top scorer was not in the squad."
    },
    {
      "date":" 2023",
      "title":"Eder Militao sends blunt Mohamed Salah warning to Real Madrid before Liverpool clash",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"David Goodwillie has left Radcliffe FC less than 24 hours after his first appearance - following widespread backlash over the controversial signing.The 33-year-old was ruled to have raped a woman back in 2011 following a high profile civil court case in Scotland. He left the Scottish side Raith Rovers last year after his signing prompted outcry.Goodwillie appeared for the Bury side on Tuesday night (February 8) and scored a hat-trick against rival team, Belper. His signing wasn't formally announced by the club.READ MORE: Damaged wheel on jet burst into flames after landing at Manchester AirportBut less than 24 hours after his first game, the club confirmed he had subsequently left, saying: Our due diligence should have been of a much higher standard.In a statement released on Wednesday morning, the club said: We can confirm that David Goodwillie has left the Club.As a Club we have always been about second chances and have been a part of many players and staff members rehabilitation along that journey, we've always given people a chance to improve their life and found support in this endeavour.ending cost them dearly as Brentford claimed another famous scalp with a 3-1 victory. An Ibrahima Konate own goal and Yoane Wissa’s header put the Bees in control, prompting angry Reds boss Jurgen Klopp to substitute key defender Virgil van Dijk at half-time. Alex Oxlade-Chamberlain pulled one back but Bryan Mbeumo killed the Reds off as they lost more ground in the race for a top-four Premier League finish. It was a case of no Ivan Toney, no problem for Brentford as Liverpool went the same way as Manchester United and Manchester City this season. Despite Thomas Frank’s upbeat assessment of the injury which forced Toney off on a stretcher at West Ham three days earlier, the Bees’ 13-goal top scorer was not in the squad."
    },
    {
      "date":"2023",
      "title":"Real Madrid handed injury boost ahead of Liverpool clash as Carlo Ancelotti admits 'this hurts'",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"Real Madrid's Italian coach Carlo Ancelotti holds a press conference on March 1, 2023, at the Ciudad Real Madrid training complex in Valdebebas, outskirts of Madrid, on the eve of their Copa del Rey (King's Cup) semi final football match against FC Barcelona. (Photo by Pierre-Philippe Marcou / AFP) (Photo by PIERRE-PHILIPPE MARCOU/AFP via Getty Images) (Image: PIERRE-PHILIPPE MARCOU/AFP via Getty Images) Karim Benzema is expected to be fit to face Liverpool despite being ruled out of Real Madrid’s upcoming La Liga clash with Espanyol. The 35-year-old, who scored twice in the Spanish giants’ 5-2 win at Anfield last month, missed training earlier this week because of an ankle. The Frenchman has been troubled by repeated muscle injuries so far this season, and was forced to withdraw from France’s squad for last year’s 2022 World Cup because of a thigh injury.court case in Scotland. He left the Scottish side Raith Rovers last year after his signing prompted outcry.Goodwillie appeared for the Bury side on Tuesday night (February 8) and scored a hat-trick against rival team, Belper. His signing wasn't formally announced by the club.READ MORE: Damaged wheel on jet burst into flames after landing at Manchester AirportBut less than 24 hours after his first game, the club confirmed he had subsequently left, saying: Our due diligence should have been of a much higher standard.In a statement released on Wednesday morning, the club said: We can confirm that David Goodwillie has left the Club.As a Club we have always been about second chances and have been a part of many players and staff members rehabilitation along that journey, we've always given people a chance to improve their life and found support in this endeavour.ending cost them dearly as Brentford claimed another famous scalp with a 3-1 victory. An Ibrahima Konate own goal and Yoane Wissa’s header put the Bees in control, prompting angry Reds boss Jurgen Klopp to substitute key defender Virgil van Dijk at half-time. Alex Oxlade-Chamberlain pulled one back but Bryan Mbeumo killed the Reds off as they lost more ground in the race for a top-four Premier League finish. It was a case of no Ivan Toney, no problem for Brentford as Liverpool went the same way as Manchester United and Manchester City this season. Despite Thomas Frank’s upbeat assessment of the injury which forced Toney off on a stretcher at West Ham three days earlier, the Bees’ 13-goal top scorer was not in the squad."
    },
    {
      "date":"2023",
      "title":"'Best player I played with' - Former Cody Gakpo team-mate praises Liverpool forward after Man United 'perfection'",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"One of Cody Gakpo’s former team-mates has labelled the Liverpool star as the best player he’s alongside - and weighed in on his goals against Manchester United. The Reds signed Gakpo from PSV Eindhoven during the January transfer window, after agreeing a deal that could reach in excess of £40 million. The Netherlands international was Liverpool’s only signing after the New Year, and he’s already impressing on Merseyside. Gakpo has scored four goals since arriving at Anfield, including two against Man United at the weekend. The 23-year-old found the back of the net in each half as the Reds won 7-0 against their bitter rivals, which further endeared himself to the club’s supporters. READ MORE: Manuel Pellegrini pokes fun at Manchester United after Liverpool humiliation READ MORE: John Henry and Jurgen Klopp have pointed out glaring Man United mistake that Liverpool have avoided A former PSV team-mate of Gakpo’s, Yorbe Vertessen, has spoken about the quality of Liverpool’s newest signing. Vertessen made 38 appearances alongside Gakpo for PSV, before he left in January to join Union Saint-Gilloise on loan. Vertessen says he watched Gakpo in action against Man United, and praised the Liverpool star for the quality of the goals.hances and have been a part of many players and staff members rehabilitation along that journey, we've always given people a chance to improve their life and found support in this endeavour.ending cost them dearly as Brentford claimed another famous scalp with a 3-1 victory. An Ibrahima Konate own goal and Yoane Wissa’s header put the Bees in control, prompting angry Reds boss Jurgen Klopp to substitute key defender Virgil van Dijk at half-time. Alex Oxlade-Chamberlain pulled one back but Bryan Mbeumo killed the Reds off as they lost more ground in the race for a top-four Premier League finish. It was a case of no Ivan Toney, no problem for Brentford as Liverpool went the same way as Manchester United and Manchester City this season. Despite Thomas Frank’s upbeat assessment of the injury which forced Toney off on a stretcher at West Ham three days earlier, the Bees’ 13-goal top scorer was not in the squad."
    },
    {
      "date":"2023",
      "title":"Eddie Howe shares theory on Liverpool's emphatic Manchester United win",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"Eddie Howe has been speaking about Liverpool's 7-0 win over Manchester United, which they failed to build on yesterday as they were beaten 1-0 at the Newcastle United manager's former club Bournemouthwas ruled to have raped a woman back in 2011 following a high profile civil court case in Scotland. He left the Scottish side Raith Rovers last year after his signing prompted outcry.Goodwillie appeared for the Bury side on Tuesday night (February 8) and scored a hat-trick against rival team, Belper. His signing wasn't formally announced by the club.READ MORE: Damaged wheel on jet burst into flames after landing at Manchester AirportBut less than 24 hours after his first game, the club confirmed he had subsequently left, saying: Our due diligence should have been of a much higher standard.In a statement released on Wednesday morning, the club said: We can confirm that David Goodwillie has left the Club.As a Club we have always been about second chances and have been a part of many players and staff members rehabilitation along that journey, we've always given people a chance to improve their life and found support in this endeavour.ending cost them dearly as Brentford claimed another famous scalp with a 3-1 victory. An Ibrahima Konate own goal and Yoane Wissa’s header put the Bees in control, prompting angry Reds boss Jurgen Klopp to substitute key defender Virgil van Dijk at half-time. Alex Oxlade-Chamberlain pulled one back but Bryan Mbeumo killed the Reds off as they lost more ground in the race for a top-four Premier League finish. It was a case of no Ivan Toney, no problem for Brentford as Liverpool went the same way as Manchester United and Manchester City this season. Despite Thomas Frank’s upbeat assessment of the injury which forced Toney off on a stretcher at West Ham three days earlier, the Bees’ 13-goal top scorer was not in the squad."
    },
    {
      "date":"07 Feb, 2023",
      "title":"Manchester United manager Erik ten Hag makes admission over Anthony Martial injury issues",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":" Manchester United manager Erik ten Hag says Anthony Martial's five lay-offs this season have all been separate injuries.Martial sustained a hip injury last week that forced him to miss the defeat of Crystal Palace on Saturday and he is unavailable for the visit of Leeds United on Wednesday night.The 27-year-old has suffered hamstring, Achilles, back and muscular injuries already this season and will sit out the 21st of United's 35 games this season. Martial has not completed 90 minutes in the Premier League for United since January 2021 and United are aiming to sell him in the summer."
    },
  
    {
      "date":"2023",
      "title":"Sloppy Liverpool slump to defeat as Brentford claim shock winn",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"Liverpool's Darwin Nunez during the Premier League match at the Gtech Community Stadium, London. Picture date: Monday January 2, 2023. PA Photo. See PA story SOCCER Brentford. Photo credit should read: John Walton/PA Wire. RESTRICTIONS: EDITORIAL USE ONLY No use with unauthorised audio, video, data, fixture lists, club/league logos or live services. Online in-match use limited to 120 images, no video emulation. No use in betting, games or single club/league/player publications. Andy Sims January 02 2023 07:39 PM Liverpool’s poor defending cost them dearly as Brentford claimed another famous scalp with a 3-1 victory. An Ibrahima Konate own goal and Yoane Wissa’s header put the Bees in control, prompting angry Reds boss Jurgen Klopp to substitute key defender Virgil van Dijk at half-time. Alex Oxlade-Chamberlain pulled one back but Bryan Mbeumo killed the Reds off as they lost more ground in the race for a top-four Premier League finish. It was a case of no Ivan Toney, no problem for Brentford as Liverpool went the same way as Manchester United and Manchester City this season. Despite Thomas Frank’s upbeat assessment of the injury which forced Toney off on a stretcher at West Ham three days earlier, the Bees’ 13-goal top scorer was not in the squad."
    },
    
    {
      "date":"2023",
      "title":"Had Many Offers From EuropeCristiano Ronaldo Reveals Reason Behind Joining Al-Nassr In Saudi Arabia",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"One of the greatest footballers of all time, Cristiano Ronaldo, landed in uncharted territory as he joined Saudi Arabian club Al Nassr in 'jackpot deal'. His move to the Middle East as a professional footballer did raise quite a few eyebrows but Ronaldo seemed to have had his reasons. The Portuguese superstar described himself as a unique player and insisted his career was not over as he arrived at his new club on Tuesday. The Portuguese forward, 37, has signed a huge deal estimated at 200 million euros ($211m) after glittering spells at Manchester United, Real Madrid and Juventus. I'm a unique player. It's good to come here, I broke all the records there (in Europe) and I want to break a few records here, Ronaldo told the media at Al Nassr's Mrsool Park stadium. I'm coming here to win, to play, to enjoy, to be part of the success of the country and culture of the country, he added. It looked like Ronaldo might continue in Europe for one or two more years but reported 'lack of interest' in his services saw him eventually sign for a Saudi Arabian club. But, according to the 5-time Ballon d'Or winner, he turned down a swathe of offers from Europe and elsewhere to join the deep-pocketed Saudis. In Europe my work is done, he said, adding: I had many offers in Europe, many in Brazil, Australia, the US, even in Portugal. Listen to the latest songs, only on JioSaavn.com Many clubs tried to sign me but I gave my word to this club, for the opportunity to have not only football but (to be) part of this amazing country. And for me it was a challenge, he said. Ronaldo has already been presented as an Al-Nassr player in a huge gathering. He could be available for selection in the club's next match on January 05 but is unlikely to feature, having not gotten training sessions under his belt yet."
    },
    
    {
      "date":"2023",
      "title":"Lionel Messi Receives Guard Of Honor Upon Return To PSG Training",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"Lionel Messi returned to Paris Saint-Germain on Wednesday for the first time as a World Cup winner. Messi had been granted time off to celebrate after leading Argentina to glory in the Qatar 2022 final 17 days earlier. Upon his return to PSG training, Messi was given a guard of honor by his teammates and the club's coaching staff."
    },
    
    {
      "date":"2023",
      "title":"Cody Gakpo makes Manchester United transfer admission following Liverpool FC move",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"New Liverpool recruit Cody Gakpo has admitted that he thought he was going to join Manchester United back in the summer transfer window following his recent switch to Anfield. Gakpo, who scored three goals in five appearances for the Netherlands at the World Cup in Qatar, sealed an initial £37million move to Liverpool from PSV Eindhoven last week. The Dutch club announced the transfer agreement late on Boxing Day evening almost a week ago, stunning United supporters into silence. Gakpo had been strongly linked with a move to Old Trafford in the run-up to this month's transfer window and was widely expected to join the club, linking up with fellow countryman Erik ten Hag. The winger, as he revealed back in October, held talks with Ten Hag, with whom he shares the same agent, back in the summer about the prospect of joining the Reds. READ MORE: United transfer news LIVE as January window opens United, in the end, managed to lure top target to Antony to Old Trafford, meaning they did not press ahead with a move for Gakpo. But such is their need for a striker, the Netherlands ace, 23, was identified as an attainable target in the run-up to this month's window, despite him playing all of his club football on the left wing. The versatile attacker has now admitted that he believed he was going to join United in the summer, such was the level of the club's interest at the time. It was difficult this summer, said Gakpo. It was a very intense period. I tried to find my peace, but it was difficult. I thought I was going to Manchester United, but in the end it didn't work out."
    },
    
    {
      "date":"2022",
      "title":"Exclusive: Fabrizio Romano explains the Enzo Fernandez Chelsea transfer situation",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"TwitterWhatsAppEmailMore It’s hard to predict what will happen next with Chelsea’s transfer move for Benfica midfielder Enzo Fernandez, according to Fabrizio Romano in his exclusive CaughtOffside column the Daily Briefing. sampdoria logo SAMPDORIA LOADING OFFICIAL CONTENT The Blues have failed to reach an agreement with Benfica for the Argentina international, and it seems there are now no talks ongoing between the Portuguese giants and any other club. Fernandez has established himself as one of the finest young players in world football, and it makes sense that a big name like Chelsea would be interested in him. Still, it looks like a difficult deal to get done, and Romano is unsure what will happen next in terms of either trying to revive talks or looking for an alternative in midfield. enzo fernandez waving Enzo Fernandez with Argentina at the World Cup “I can’t predict what decisions Chelsea will make next on Enzo Fernandez,” Romano said. “But I can tell you what’s going on now: there are no more meetings scheduled while I’m writing. More Stories / Latest News Everton make Frank Lampard decision after latest development Everton make Frank Lampard decision after latest development 1 day ago Surprising Chelsea stat surely means Man City are going to make up ground on Arsenal tonight Surprising Chelsea stat surely means Man City are going to make up ground on Arsenal tonight 1 day ago Liverpool poach key man from Chelsea as London club continue exodus Liverpool poach key man from Chelsea as London club continue exodus 1 day ago “Let’s see if Chelsea will return, if they will change their mind; but Chelsea offered €85m for Enzo and Benfica president Rui Costa always said: €120m or nothing. So at the moment, no other clubs involved and situation to be resolved.” Meanwhile, Romano also confirmed that Benoit Badiashile and Andrey Santos are both done deals for Chelsea, though it’s not yet clear when the signings will be officially announced."
    },
    
    {
      "date":"2022",
      "title":"Manchester United transfer news RECAP David de Gea contract updates and Joao Felix to Man United latest",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"Erik ten Hag looks to be moving quick to replace Martin Dubravka, who requested to end his season-long loan spell early this week. His New Year's Day exit means Manchester United are left with Tom Heaton and Nathan Bishop as back-ups to David de Gea. Jack Butland has been in talks over a loan move until the end of the season. De Gea himself has spoken out about his future with his deal due to run out in June. The goalkeeper has a one-year extension option in his contract and has expressed his desire to stay on at Old Trafford. Meanwhile, United are still on the hunt for a striker with the loan market again to be explored. Joao Felix, Memphis Depay and Tammy Abraham have all been linked with move to the Reds who were sweating over the fitness of lone central striker Anthony Martial against Bournemouth. However, his knock doesn't seem to be too serious albeit it further highlights Ten Hag's frontline fragility. TODAY'S BIG TALKING POINT: Should United sign Butland? Have your say here. A recap of the days United news."
    },
    
    {
      "date":"2022",
      "title":"Chelsea legend Gianluca Vialli dies aged 58",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"Former Chelsea footballer Gianluca Vialli has died at the age of 58, five years after he was first diagnosed with pancreatic cancer. The Italian football legend registered 40 goals in 88 appearances for the London club between 1996 and 1999, before going on to manage the Blues, where he won three major trophies. Vialli guided Chelsea to the League Cup and European Cup Winners' Cup, before winning the FA Cup in 2000. Vialli made 59 appearances for his country and later joined Roberto Mancini's staff with the Italian national team, which came after he was given the all clear from his cancer in 2020. He was part of the coaching team when Italy won the European Championships in 2021. However, the former Chelsea man stepped down from his position last month when he returned to the Royal Marsden hospital to undergo further treatment on the cancer. Chelsea posted a tribute to Vialli on Twitter, which read: You’ll be missed by so many. A legend to us and to all of football. Rest in peace, Gianluca Vialli. A number of other football clubs paid tribute to the Italian, with Serie A side Udinese writing: A great man, a great champion and fighter on the field and in life. You left early, bloody early but you will always remain in our hearts with your unforgettable example and class. Ciao Gianluca."
    },
    {
      "date":"2022",
      "title":"Man City handed all-Premier League tie in Carabao Cup quarter-final after Liverpool FC win",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
   "body":"Manchester City will face Southampton in the quarter-final of the Carabao Cup at Saint Mary's Stadium. City, who have won the competition in four of the last five seasons, most recently winning it during the 2020/21 campaign, sealed their place in the last eight with a 3-2 win over Premier League rivals Liverpool at the Etihad Stadium on Thursday evening. Erling Haaland, Riyad Mahrez and Nathan Ake were all on the scoresheet for Pep Guardiola's side, with Fabio Carvalho and Mohamed Salah scoring for the visitors. Liverpool drew level twice in the game, but the home side took the lead for the third time in the 58th minute and were able to see the remainder of the tie out. READ MORE: Man City player ratings vs Liverpool FC City's reward for getting the better of Jurgen Klopp's side is a quarter-final showdown with Southampton. The Saints sealed their place in the last eight with a win over Lincoln City on Tuesday evening. Prior to the draw, Blues attacker Mahrez admitted that Guardiola's side would be focusing on the Premier League until the quarter-final tie came around."
    },
     {
        "date":"2022",
      "title":"Transfer Centre LIVE! Diogo Costa could cost Man Utd £65m | N'Golo Kante wants Barcelona move",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
      "body":"Meanwhile, Chelsea midfielder N'Golo Kante wants a pre-contract deal with Barcelona in January, according to reports in Spain.The La Liga giants are said to have held talks with Kante's representatives as they consider a free transfer for the 31-year-old in the summer.Kante's contract at Stamford Bridge expires at the end of the season. The Frenchman has made 262 appearances for Chelsea since joining from Leicester in 2016 but has struggled with injury this campaign."
    },
     {
        "date":"2022",
      "title":"England complete historic 3-0 series sweep in Pakistan as Ben Duckett ends unbeaten on 82",
      "img":"https://raw.githubusercontent.com/fotlivemm123/fotlive/main/fotlive.jpg",
      "body":"Heading into their first tour of Pakistan for 17 years, England had only beaten the hosts in Test matches twice before on their own turf - and the last of those came in 2000 in the dark in Karachi. Returning to the National Stadium for the final match of this series, Duckett's unbeaten half-century and an opening stand of 87 with Zak Crawley (41) in the evening session on day three had put Stokes' side on the verge of victory. Trending Transfer Centre LIVE! Costa could cost Man Utd £65m | Kante wants Barca move Papers: FIFA president Infantino wants to hold World Cup every three years Redknapp: England didn't have a good WC | Any decent manager could do Southgate's job The Premier League returns: Where did we leave things? England complete historic sweep of Pakistan with comfortable victory Bayern condemn racist abuse towards Coman after WC final Price survives scare at Worlds after Beaton is battered I De Sousa wins thriller 'Messi's football fairytale ends a controversial tournament' - World Cup review Messi's World Cup win confirms his status as the greatest Reaction from England's 3-0 Test series sweep of Pakistan Video Latest News Stokes signalled his intent in the second over of the day when he pulled Mohammad Wasim through midwicket for the first four of the morning, with he and his partner running aggressively between the stumps as well. The duo soon passed the half-century mark for the third wicket, too, although the England captain had a let-off when he was put down on 22 by Agha Salman in the deep off Abrar Ahmed."
    }
  
  
  
  
  
  ]
