[
  {
    "date":"20 Dec, 2022",
    "title":"The Premier League returns: Analysing every team's situation as the season resumes after the World Cup",
    "img":"https://e0.365dm.com/22/12/1600x900/skysports-premier-league-christmas_5998283.jpg?20221216114636",
    "body":"So, where were we then? Football didn't come home from Qatar in the end. That's alright - because what we're really after is the nerve-jangling, topsy-turvy, nail-biting rollercoaster that is Premier League football. All the Premier League fixtures live on Sky Sports this winter Mid-season friendlies - how did PL teams prepare for the restart? Get Sky Sports | Download the Sky Sports App | Get NOW to stream biggest moments The excitement of the World Cup means some may struggle to remember exactly where we left things in the top-flight back in the middle of November. Teams were on cloud nine, managers were under pressure, players were going through purple patches and fans were as vocal as ever, both positively and negatively. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location A look back at all key stories that unfolded in the Premier League before the World Cup break. So many questions need answering over the next six months. Is this Arsenal's time? Can the out-of-form clubs at the bottom turn their fortunes around? Have Manchester United actually turned a corner? Sky Sports' football writers give us a detailed reminder about the talking points at each Premier League club - and where their fate could lie… Trending Transfer Centre LIVE! Costa could cost Man Utd £65m | Kante wants Barca move Papers: FIFA president Infantino wants to hold World Cup every three years The Premier League returns: Where did we leave things? Redknapp: England didn't have a good WC | Any decent manager could do Southgate's job England complete historic sweep of Pakistan with comfortable victory Price survives scare at Worlds after Beaton is battered I De Sousa wins thriller Bayern condemn racist abuse towards Coman after WC final Messi's World Cup win confirms his status as the greatest 'Messi's football fairytale ends a controversial tournament' - World Cup review Titles still McLaren's aim after early Seidl exit | 'We won't miss a beat' Video Latest News Arsenal Position: 1st (37 points) Top goalscorer: Martin Odegaard (6 goals) Also See: Premier League fixtures Premier League top scorers & assisters Get Sky Sports Get NOW to stream big moments Next three PL games: West Ham (H), Brighton (A), Newcastle (H) A month on from their last Premier League game, Arsenal fans could be forgiven for thinking it was all a dream. But it wasn't. You really are five points clear of Manchester City at the top of the table. The challenge now is staying there and the task has been made harder by the knee injury which curtailed Gabriel Jesus' World Cup involvement and is expected to keep him out for three months. Gabriel Jesus rues a missed chance against Aston Villa Play Video - Zinchenko: Gabriel Jesus will be back 'much stronger' Oleksandr Zinchenko admits Gabriel Jesus' injury will be a 'big miss' for Arsenal and he's contacted the striker to offer support The Brazilian striker only scored five times in the 14 Premier League games before the break - and none in the last six - but his impact on Arsenal's all-round game following his arrival from City has been transformational. Will they be able to sustain their brilliant start without him? Others have stepped up in terms of their scoring output, including Martin Odegaard, Gabriel Martinelli, Bukayo Saka and Granit Xhaka, who have netted 18 goals between them, but replacing everything else Jesus offers is another matter. Eddie Nketiah will hope to seize his chance. The January transfer window may open up possibilities too. But Arsenal head into the restart knowing how they cope without Jesus is likely to make or break their title challenge. Nick Wright Arsenal&#39;s Eddie Nketiah reacts after his side&#39;s first goal of the game is ruled out for offside during a friendly match at Emirates Stadium, London. Picture date: Saturday December 17, 2022. Image: Eddie Nketiah will likely hold the centre forward role as his own for the next few weeks Aston Villa Position: 12th (18 points) Top goalscorer: Danny Ings (6 goals) Next three PL games: Liverpool (H), Tottenham (A), Wolves (H) The humbling defeat at Fulham which led to Steven Gerrard's sacking within two hours of the full-time whistle is long forgotten at Aston Villa now. Three Premier League wins from four and the appointment of Unai Emery quickly moved the club into a new era - and crucially five points above the drop. Victories over Manchester United and Brighton in Emery's first two games raised hopes that their UAE training camp could be used to even greater effect. After all, it has been away from home where the team's issues have been laid bare, accumulating just five points from eight matches. Aston Villa manager Unai Emery before kick off at the Amex Stadium Image: New Aston Villa manager Unai Emery has been given a mini-pre-season with his squad But top of the list of problems for Emery to fix is an attack that has produced only 16 goals in 15 games. After scoring just seven times in the first 11 matches under Gerrard, they have netted nine in the four since. Emery has deployed a 4-2-2-2 formation that benefits forward pair Ollie Watkins and Danny Ings, and also appears to suit midfielders such as Douglas Luiz, Boubacar Kamara and John McGinn. But Villa need attacking reinforcements this winter - particularly in wide areas - if they are to push for a top-half finish. A move for talented forward Joao Felix seems ambitious although Villa fans will welcome a more positive approach under Emery. David Richardson Bournemouth Position: 14th (16 points) Top goalscorers: Phillip Billing and Kieffer Moore (4 goals) Next three PL games: Chelsea (A), Crystal Palace (H), Man United (A) A lot can change in four weeks. Since the start of the World Cup, Bournemouth have appointed Gary O'Neil as their permanent head coach and become the latest top-flight club to fall under American ownership. Although Bill Foley's £100m-plus takeover had been on the cards for months, confirmation of the deal was only announced last week. A general view of the corner flag during the Premier League match at the Vitality Stadium, Bournemouth. PA Photo. Picture date: Sunday January 12, 2020. See PA story SOCCER Bournemouth. Photo credit should read: Adam Davy/PA Wire. RESTRICTIONS: EDITORIAL USE ONLY No use with unauthorised audio, video, data, fixture lists, club/league logos or &#34;live&#34; services Play Video - Foley completes Bournemouth takeover Sky Sports reporter Mark McAdam provides further details about American businessman Bill Foley's consortium which has completed its purchase of Bournemouth Football Club worth over £100m The 78-year-old Las Vegas-based billionaire has already revealed his plans to develop the Vitality Stadium and training facilities on the south coast, and he exclusively told Sky Sports News he expects "four or five new players" to arrive in the January transfer window. Assisted by Hollywood award-winning actor, director and producer Michael B. Jordan, Foley has immediately put Bournemouth under the international spotlight. It's an exciting time for everyone involved with the club. The immediate aim remains Premier League survival, but Foley clearly believes O'Neil can achieve that feat having steadied the ship since Scott Parker's dismissal at the end of August. Bournemouth have won four, drawn four and lost four under the 39-year-old and are 14th in the table, three points above the relegation zone. Gary O&#39;Neil has impressed as Bournemouth interim head coach Image: Gary O'Neil was given the Bournemouth manager's role in the World Cup break There is sure to be an extra buzz around the town when the Cherries play their first home game in seven weeks against Crystal Palace on December 31. Foley will be watching in person that day. The resumption of the domestic season may not seem a hugely significant moment for most, but for Bournemouth it represents the dawn of a new era. Dan Sansom Brentford Position: 10th (19 points) Top goalscorer: Ivan Toney (11 goals) Next three PL games: Tottenham (H), West Ham (A), Liverpool (H) Barring the 5-1 horror show at Newcastle and the 4-0 defeat away to Aston Villa, Brentford had quashed any speculation over whether they were about to be the next victims of the fabled 'second season syndrome' by the time the Premier League paused for the World Cup last month. If it was not the case already, they appear to have very much established themselves as part of the furniture in the top flight. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location FREE TO WATCH: Highlights from the Premier League match between Manchester City and Brentford And who could forget the way in they entered the break? Days after an embarrassing Carabao Cup shootout defeat to Gillingham, they went to the Etihad as outright underdogs, yet failed to crumble and came away with a fully deserved 2-1 win against reigning Premier League champions Manchester City. The Bees' talisman frontman Ivan Toney was very much in the spotlight that afternoon. He responded to Gareth Southgate's decision to omit him from the England squad by scoring both goals, which left many questioning why he would not be travelling to Qatar, particularly given his exquisite penalty record and the fact he was the league's second highest scoring Englishman with 10 goals, behind only Harry Kane. Just a few days later, it was revealed that Toney had been charged over 232 alleged breaches of betting rules between February 2017 and January 2021. Ivan Toney scored his and Brentford&#39;s second from the spot Image: Will Brentford have Ivan Toney (right) in the second half of the season? There has been no further update since, but Toney was part of Brentford's trip to Spain earlier this month and played an active part in friendlies against Bordeaux and Celta Vigo. If the allegations against him are proven, the striker could face a lengthy ban. Given the fact he has scored 11 of Brentford's 26 goals in all competitions so far this term - with Bryan Mbeumo and Yoane Wissa following up with three each - you do get the feeling the Bees will be looking over their shoulder somewhat with regards to developments in the saga. Dan Long Brighton Position: 7th (21 points) Top goalscorer: Leandro Trossard (7 goals) Next three PL games: Southampton (A), Arsenal (H), Everton (A) Roberto De Zerbi endured a difficult start to life at Brighton after his explosive debut in the dugout - the 3-3 draw with Liverpool in October - proceeding to lose three of the following four games. However, that slump was turned on its head when the Italian oversaw a shock 4-1 win over former Brighton manager Graham Potter and his Chelsea megastars - before beating rock-bottom Wolves 2-1 the following week. But Brighton failed to sustain the winning momentum and signed off for the World Cup break with a 2-1 defeat against Aston Villa - so De Zerbi would have welcomed the six-week period to reset and evaluate. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location FREE TO WATCH: Highlights from the Premier League match between Brighton and Aston Villa That said, Brighton's impressive start to the campaign means they sit seventh in the table, ahead of Chelsea and merely one point shy of Liverpool. Eight players represented Brighton in Qatar, including World Cup winner Alexis Mac Allister - another indication of the club's phenomenal development in recent years. In terms of spending power in the upcoming transfer window, the Seagulls have cash to spend after offloading key players Yves Bissouma and Marc Cucurella for big bucks in the summer, receiving compensation from Chelsea for Potter and selling Ben White to Arsenal for £50m in July 2021. However, Brighton tend to remain frugal and recruit left-field players at bargain prices. Mac Allister is a perfect example: scouted and approached in Argentina after intensive data research - signing the midfielder for only £7m. GRAPHIC The numbers suggest Brighton's playing style has been similar to 'big six' clubs for a while, but with one stark difference: they have lacked a clinical goalscorer. Indeed, despite limited options up top, the club ranks among the top seven teams for goals, expected goals, shots, chances created, total passes, passes in the final third and reclaiming possession in the final third. With the world-class talents of Mac Allister, Leandro Trossard and Moises Caicedo delivering in midfield and attack, De Zerbi might look to bolster his defence as a priority in January, having conceded 14 goals in his eight games. GRAPHIC Against Villa, Pascal Gross started at right-back for the third game running, while Lewis Dunk partnered 19-year-old Chelsea loanee Levi Colwill - with the Brighton boss forced to settle for some makeshift fixes after Adam Webster was ruled out with illness. Ghana international Tariq Lamptey provides a quality option at full-back, but the Seagulls would certainly benefit from signing a centre-back and full-back, too. Crucially, Brighton must stave off interest in their key World Cup stars. Adam Smith Chelsea Position: 8th (21 points) Top goalscorer: Raheem Sterling (5 goals) Next three PL games: Bournemouth (H), Nottingham Forest (A), Manchester City (H) Chelsea supporters could be forgiven for not wanting to remember how their side ended the first half of the season. The 1-0 defeat at Newcastle in their final match before the World Cup was their third loss in a row, with the Blues failing to register a goal, let alone a point, in that run. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location Despite having not won in five Premier League games, Stephen Warnock believes Chelsea boss Graham Potter needs to be given more time to turn their fortunes around The pause in the season came at the perfect time for Graham Potter who, after enjoying a nine-game unbeaten start after arriving in September, looked like a man in need of a break by November. The former Brighton boss likened the task of guiding Chelsea through their busy fixture schedule to being in a washing machine and spoke of his need to "recover". After presumably taking time to analyse his first months at Stamford Bridge, Potter was back at work earlier this month, leading Chelsea's training camp in Abu Dhabi. With the head coach desperate to turn around his side's form, he'll be relieved that they resume their season with two very winnable games - Bournemouth at home and Nottingham Forest away. If Potter is able to help Chelsea collect six points from those fixtures, he and his players will generate some much-needed momentum ahead of a double-header against Manchester City at the beginning of January. Graham Potter Image: Chelsea have been struggling for consistency this season But if the west Londoners continue to struggle upon their return to the pitch, the pressure on Potter will quickly return - as will the questions over the direction in which Todd Boehly and his consortium are taking the club. Joe Shread Crystal Palace Position: 11th (19 points) Top goalscorer: Wilfried Zaha (6 goals) Next three PL games: Fulham (H), Bournemouth (A), Tottenham (H) Crystal Palace are just about where you would expect them to be approaching the halfway mark of the season. Five wins from 14 matches has left them in 11th ahead of the league's resumption. On Boxing Day, they host Fulham at Selhurst Park. Despite failing to re-sign Conor Gallagher on loan, Palace have managed to maintain their consistency - in fact, they have improved their return from this stage of last season by three points. Odsonne Edouard (right) celebrates his goal with teammates Image: Crystal Palace have improved on last season's points tally The only gloomy cloud hanging over Selhurst Park is the uncertain future of star man Wilfried Zaha. With his deal at Palace expiring at the end of the season, the 30-year-old is reportedly considering his options away from his boyhood club. Michael Olise and Eberechi Eze have shown their quality, but need to take a step up if they are to fill the enormous void that Zaha's departure would create. The rest of this season could be key for the exciting, attacking duo and their development to learn more from Zaha before taking on his mantle as bona fide match-winners. Zinny Boswell Everton Position: 17th (14 points) Top goalscorer: Anthony Gordon and Demarai Gray (3 goals) Next three PL games: Wolves (H), Man City (A), Brighton (H) The last time Everton took to a pitch, they were seen wandering around the Vitality Stadium like lost souls for the second time in the space of four days. They can ill-afford a rough return when Wolves visit Goodison Park on Boxing Day. Frank Lampard and his players react to Everton fans expressing their dissatisfaction with the loss to Bournemouth and team&#39;s performance Image: Frank Lampard and his players react to Everton fans expressing their dissatisfaction with the loss to Bournemouth and team's performance Frank Lampard will have spent recent weeks looking to recalibrate his options after an encouraging start to his first full season went suddenly stale on the south coast. An aggregate 7-1 defeat to Bournemouth across league and cup fixtures drew unsavoury scenes from the away end but Everton have since been to Australia to heal those wounds and refocus minds. No side has conceded more shots from high turnovers (29) suggesting that Lampard may again have to revert to a more pragmatic approach if better results don't soon materialise. The Everton manager won't want to fully undo what he will see as a work in progress; James Tarkowski and Conor Coady have formed a solid partnership in front of Jordan Pickford while there is guile, craft and poise in the emerging talent of Amadou Onana alongside the experienced Idrissa Gueye and Alex Iwobi revelling in his new role. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location Everton's Alexander Iwobi speaks proudly about his growth within the club and how he feels supported by the fans and Frank Lampard But in order for those doubters to become believers once more in the Lampard project, a significant points return from a hectic run of games and transfer window must lie ahead. Offensively, Everton need a player who can wreak havoc between the lines. They need a fully fit Dominic Calvert-Lewin, and they also need to address the void left by Richarlison, as they hang just above the relegation zone. Only then can the club grow big in stature again. Ben Grounds Fulham Position: 9th (19 points) Top goalscorer: Aleksandar Mitrovic (9 goals) Next three PL games: Crystal Palace (A), Southampton (H), Leicester City (A) Fulham were sitting pretty in ninth when the season broke up for the World Cup, a more than respectable showing for a team that only won promotion back to the Premier League last summer - but their fans were left wondering whether the break came at a good or bad time. Marco Silva's side had just suffered back-to-back defeats in the league - only their fifth and sixth of the campaign - albeit at champions Manchester City and at home to Manchester United. Fulham&#39;s Aleksandar Mitrovic in action during the Premier League match against Liverpool at Craven Cottage Image: Fulham will be desperate to keep top scorer Aleksandar Mitrovic fit when the season resumes Both those 2-1 reverses came about courtesy of deflating stoppage-time strikes, so maybe the interruption for the World Cup came at the right time for the Cottagers, especially as at the time top scorer Aleksandar Mitrovic was absent with a foot injury. The Serbia international is going to be key to Fulham's hopes of having a similarly successful second half of the campaign and securing a possible top-half finish in their first season back in the Premier League. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location FREE TO WATCH: Highlights of Fulham against Manchester United in the Premier League Mitrovic scored an impressive nine times in just 12 league games before the World Cup and Silva will no doubt have been relieved when Serbia suffered an early exit at the group stage in Qatar, affording his main man - who started every game for his country in the tournament - some much-needed rest before the action gets under way again at Crystal Palace on Boxing Day. If Fulham can keep Mitrovic fit between now and May, they will surely be eyeing a top-10 finish. Richard Morgan Leeds Position: 15th (15 points) Top goalscorer: Rodrigo (9 goals) Next three PL games: Manchester City (H), Newcastle (A), West Ham (H) The restart looks daunting for Jesse Marsch's Leeds, who welcome Manchester City before travelling to third-placed Newcastle. But remember: Leeds went into the World Cup break as the division's great entertainers. Just the 22 goals were scored in Leeds' four most recent league matches. That run included a victory at Anfield, and the comeback win from 3-1 down to 4-3 up against Bournemouth. Jurgen Klopp Andy Robertson Liverpool Leeds Image: Leeds were the great entertainers before the World Cup break began They were then 10 minutes away from beating Tottenham before they themselves suffered a 4-3 turnover. Those results have just about kept Marsch in a job at Elland Road - with the German-American appearing on the brink after a 3-2 home loss to Fulham in late October. The World Cup break may well have suited Patrick Bamford, who had the rest needed to not only avoid injury but also put in some work on the training ground as he eyes a return from an unfortunate run of injuries. But if Bamford is still not up to scratch, Leeds will have to look elsewhere. There's plenty of youthful promise in Crysencio Summerville, Wilfried Gnonto and Brenden Aaronson behind Rodrigo - whose goal record somehow defies the rest of his play. Jesse Marsch Image: Jesse Marsch has steadied the ship after facing the pressure But can a leaky defence stand strong in the opening weeks? They can't just rely on Tyler Adams, who put in some excellent World Cup displays while captaining the United States in Qatar. Sam Blitz Leicester Position: 13th (17 points) Top goalscorer: James Maddison (7 goals) Next three PL games: Newcastle (H), Liverpool (A), Fulham (H) Whether or not the timing of the World Cup was positive for Leicester City remains to be seen. In September, at the foot of the table, Brendan Rodgers and his squad probably would have snapped your hand off for a break from the negativity swirling around the club. Brendan Rodgers watches on at the Vitality Stadium Image: Brendan Rodgers has recovered from a poor start to remain in charge at Leicester However, an upturn in form for James Maddison helped the East Midlands club jump up to 13th in the table, just four points from seventh. With sixth to 17th separated by only eight points, European football remains an ambitious yet achievable target. The Foxes will need to overcome sides that were in form before the World Cup such as Fulham, Brighton and Brentford. The World Cup will feel like a race restart following a crash in F1 - yes, there is an order, but momentum is lost, so anyone can capitalise if they play their cards right. The momentum of Maddison, on his return from Qatar, will be crucial for Leicester. He didn't feature in any of England's World Cup campaign, so may not have the match-fitness Rodgers wants. However, he will have recovered from the injury he had ahead of the World Cup, and has spent the last month training with some of the best players in England. James Maddison has named in England&#39;s World Cup squad for Qatar Image: James Maddison was named in England's World Cup squad for Qatar It will also be intriguing to see what business Leicester can do during the January transfer window. They have been linked with Morocco midfielder Azzedine Ounahi, who has helped the Atlas Lions maintain their record of having only conceded once since June. But goals have been limited for Leicester, so they will need to recruit more chance-makers, like Maddison, if they are to continue their ascent up the table after a slow start. Adam Williams Liverpool Position: 6th (22 points) Top goalscorer: Mohamed Salah (14 goals) Next three PL games: Aston Villa (A), Leicester (H), Brentford (A) Following the news that forward Luis Diaz has suffered a setback in his recovery from a knee injury, Liverpool boss Jurgen Klopp will likely have to continue using Darwin Nunez as a left-sided forward when the Reds return to action at Aston Villa on Boxing Day. Klopp will therefore be hoping Liverpool's club-record signing can continue where he left off before the season was put on temporary hold, with the striker finally appearing to have settled at Anfield after his summer move from Benfica. Darwin Nunez celebrates putting Liverpool back in front Image: Darwin Nunez celebrates scoring for Liverpool against Southampton before the World Cup break The Uruguay international endured a tough start to his Liverpool career after getting sent off on his home debut against Crystal Palace in August, halting any momentum he had gained from scoring in his first two games for his new side. His next goal did not arrive until October in a 3-2 loss at Arsenal, but that strike appeared to give the 23-year-old a newfound confidence that he belonged at the club as he went on to net in league wins over West Ham and Southampton, while also contributing an assist in victory at Tottenham, as well as Champions League goals against Rangers, Ajax and Napoli. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location FREE TO WATCH: Highlights from the Premier League match between Liverpool and Southampton In fact, Nunez and Liverpool did not want the campaign to stop after his double in a 3-1 home win over the Saints last month, which was without doubt the new man's best display for the Reds. And while that impressive scoring run did come to an end while with Uruguay in Qatar, Klopp will be praying Nunez picks up where he left off over the busy Christmas period as the Reds look to make up ground in the race for the top four. Richard Morgan Man City Position: 2nd (32 points) Top goalscorer: Erling Haaland (23 goals) Next three PL games: Leeds (A), Everton (H), Chelsea (A) City find themselves in the somewhat unfamiliar position of being in the chasing pack as the season resumes. Pep Guardiola's side will need to be ready to pounce on any slip-ups by league leaders Arsenal, and perhaps hope that the Gunners will struggle to cope with the absence of former City forward Gabriel Jesus. Pep Guardiola shows his frustration Image: Pep Guardiola did not go into the World Cup break on top of the Premier League table The Citizens have chart-topping return for goals, expected goals, shots, creating chances, passes and passes in the final third - nothing new there. At the other end, two opposing teams have shipped fewer goals - Arsenal and Newcastle - but City's expected goals conceded remains at a league-low figure - so they still give up the fewest clear-cut chances. Julian Alvarez has boosted his profile at the World Cup after supplanting Lautaro Martinez in the Argentina starting XI and will be expecting more game time as a result. Phil Foden announced himself on the world stage, too. Meanwhile, England team-mate Kalvin Phillips has recovered from injury and will provide more depth in midfield. Norway international Erling Haaland with be replenished from his break: the 22-year-old has a league-high 18 goals in just 13 appearances. The Premier League returns to Sky Sports on Friday 30th December, and we know one player who’s counting down the days… Play Video - Erling needs games! The PL is back... almost The Premier League returns to Sky Sports on Friday 30th December, and we know one player who’s counting down the days… Just before the break, Haaland's strike-ratio dipped from other-worldly levels to three goals in his last four league games. Is that a dip? For Haaland, probably. Wounded World Cup stars such as Kevin De Bruyne, Ilkay Gundogan and Joao Cancelo will look to regroup with points to prove. Additionally, Guardiola has signed a new two-year deal to keep him at the Etihad until at least 2025, ample time to expand the trophy cabinet. Remember, Guardiola has won the Premier League in four of his previous five campaigns. To summarise, City don't need to dip into the market for first-team players. Arguably, how Arsenal approach the transfer market next month could play a pivotal role in determining the scale of City's challenge ahead. Adam Smith Man United Position: 5th (26 points) Top goalscorer: Marcus Rashford (8 goals) Next three PL games: Nottingham Forest (H), Wolves (A), Bournemouth (H) Perhaps above all else, the World Cup break has succeeded in drawing a line under the unwanted sideshow that was overshadowing Manchester United's progress under Erik ten Hag. After his walk-off against Tottenham and inflammatory interview, the Cristiano Ronaldo saga is finally at an end. The player has got his wish to leave Old Trafford, and if Ten Hag was honest, he's probably got the outcome he wanted too. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location Manchester United manager Erik ten Hag gives his thoughts on the recent departure of Cristiano Ronaldo as well as how the club are dealing with a mid-season break due to the World Cup While helpful, removing Ronaldo from the equation doesn't instantly solve United's problems. As their warm-weather friendly defeats to Cadiz and Real Betis indicated, work remains for the collective to truly embrace Ten Hag's footballing principles. The curious case of Jadon Sancho, exiled to the Netherlands to undergo private fitness sessions, would suggest work remains for some individuals, but United fans have reason to be overwhelmingly hopeful at the league returns. From World Cup winner Lisandro Martinez, to Marcus Rashford and forgotten man Harry Maguire, key personnel have returned from Qatar with their reputations enhanced and should hit the ground running upon resumption. Jack Wilkinson Newcastle Position: 3rd (30 points) Top goalscorer: Miguel Almiron (8 goals) Next three PL games: Leicester (A), Leeds (H), Arsenal (A) For some sides, the World Cup break came as a welcome chance to reset and recharge after a hectic first part to this Premier League season, but Newcastle supporters didn't want it to end. Eddie Howe and his players exceeded all expectations with their impressive start to the campaign and after signing off with five wins on the spin, they will return to action flying high in third place. Newcastle United&#39;s Joe Willock (front left) celebrates scoring their side&#39;s first goal of the game during the Premier League match at St James&#39; Park, Newcastle. Picture date: Saturday November 12, 2022. Image: Newcastle went into the World Cup break in third place The key question is: will Newcastle be able to pick up where they left off and recapture that momentum, belief and positive feeling around the club that propelled them to those heights? That may depend on the quality of work Howe and his coaching staff have been able to do with the players during the pause - and the signs are encouraging. Newcastle showed no evidence of rustiness during a 5-0 demolition of Saudi Arabian champions Al-Hilal during their warm weather training camp in the country, with Miguel Almiron and Joelinton both scoring twice. That touring group - now back in the north east - will soon be supplemented by the five Newcastle players who went to the World Cup - and the good news from the team's perspective is that none of those players were overworked or went beyond the quarter-finals in Qatar. Play Video - Howe: We want to re-establish our momentum after break Newcastle manager Eddie Howe says he wants his side to re-find the momentum and rhythm they had from before the World Cup break Bruno Guimaraes, Nick Pope, Kieran Trippier, Callum Wilson and Fabian Schar should be relatively fresh mentally and physically for what's to come. Rather than an unwelcome stoppage, perhaps the break could ultimately prove to be a benefit. Certainly, if Newcastle can hit the ground running on their return, they have a favourable run of fixtures to capitalise on - although Arsenal away on January 3 could be a key indicator of whether this second part of the season will match up to the first. Peter Smith Nottingham Forest Position: 18th (13 points) Top goalscorer: Taiwo Awoniyi (3 goals) Next three PL games: Nottingham Forest (A), Chelsea (H), Southampton (A) Following a fantastic Championship run, ending in a play-off victory against Huddersfield, Nottingham Forest poured resources into making them a top-tier team. It was clearly a project that the club could sell to players, 22 to be exact. As Forest restart their Premier League campaign in 18th position, you wonder whether it's a project that the players still believe in? Of course, there was the high of beating struggling giants Liverpool in October. But it has largely been a difficult reality for Forest, who find themselves just three points above the foot of the table. A relegation scrap is almost definitely on the cards. Forest players Image: Nottingham Forest need points quickly if they want to secure a spot in the division Then again, the Premier League is tight and congested this season. A Boxing Day win for Steve Cooper's side could take them up to 14th, level on points with Leicester, if other results go their way. A glance at the goal difference tells you exactly what needs sorting out for Forest. Leicester's is zero while Forest's is -19 - a less leaky tally would lead to a difference in fortune. If Forest can take anything away from their first two games against Manchester United and Chelsea, that will be a bonus. But it could well be that Forest's season restarts in game three against Southampton, who accompany them in the drop zone. That's a must-win match. If they were to win that, there is no reason why Forest cannot stay up. Adam Williams Southampton Position: 19th (12 points) Top goalscorer: Che Adams (6 goals) Next three PL games: Brighton (H), Fulham (A), Nottingham Forest (H) The big question before the World Cup break: stick or twist? Southampton's board chose pragmatically to twist, a week earlier than originally scheduled, but such is the changing mood of football hierarchies. Results are persuasive. And the reality is Southampton were starved of them. Problems date back further than the summer transfer window, but Ralph Hasenhuttl will have been left thinking 'what if' when he vacated his post in early November. What if Southampton managed to land one of the offensive targets they had long been linked with? New Southampton boss Nathan Jones celebrates his side&#39;s equaliser Image: New Southampton boss Nathan Jones is another manager to have a pre-season The prospect of attracting Netherlands star Cody Gakpo, mooted for a summer move, to the shores of the south coast are now surely slim to none, not least because of his inflated price tag. Portugal's Goncalo Ramos was another World Cup hotshot to reportedly slip through the net. At least the tournament itself provided some respite from the misery of losing - nine of their 15 league games ended in defeat. Southampton had also flatlined in front of goal during first half of the season with only Everton, Nottingham Forest and Wolves scoring fewer. Tasked with rejuvenating their deteriorating fortunes is Nathan Jones - a Premier League beginner. Sounds risky. Known for his man-management skills, the former Luton Town boss will need to hit the ground running if Saints have any chance of allaying fears of the drop. Play Video - 'I'm not David Blaine!' - Jones warns Saints changes will take time New Southampton manager Nathan Jones says any changes he makes at the club will take time, but he's confident he can turn the club's fortunes around January is a mean place to be shopping for season-saviours. Exaggerated price points make it almost impossible to land a bargain and Southampton simply don't have the financial clout to rival the division's big hitters. So, they'll need to be savvy. As they were over the summer, but this time focus solely on adding a proven striker to the ranks. Only then can they hope to put distance between themselves and the dreaded red line. Laura Hunter Tottenham Position: 4th (29 points) Top goalscorer: Harry Kane (13 goals) Next three PL games: Brentford (A), Aston Villa (H), Crystal Palace (A) Sitting in the top four and through to the last-16 of the Champions League makes for pleasant reading for Tottenham, but truthfully results have outpaced performances with only a handful of wins delivered convincingly. The main frustration for Spurs fans is the team's habit of lacklustre first-halves followed by free-flowing second-halves, which is reflected in the fact that Tottenham have failed to lead at half-time in their last nine matches in all competitions. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location FREE TO WATCH: Highlights of Tottenham against Leeds in the Premier League Spurs will have to cut out the slow starts if they are to have a strong second-half to the season. What will help Antonio Conte in achieving this is the return of Dejan Kulusevki. The Swedish winger returned to the starting line-up for the first time since September in Spurs' final game before Qatar - the rollercoaster 4-3 home win over Leeds - and made a massive difference as he superbly assisted Rodrigo Bentancur's late winner. Rodrigo Bentancur celebrates with Dejan Kulusevski after scoring against Leicester Image: Dejan Kulusevski (left) and Rodrigo Bentancur will be key players in Tottenham's second half of the season The 22-year-old is vitally important to this Spurs side - his directness and creativity was sorely missed in his two-month absence due to a hamstring injury. Another injury to him would be a major blow. Kulusevski is also a reminder of how important the January transfer window can be - his deadline day arrival along with Rodrigo Bentancur transformed Spurs last season. The club will need a repeat of this type of business this winter if they are to maintain their top four challenge, while a potential new deal for Conte - who resumed contract talks with Tottenham on Monday - could just be the ticket to ending the club's agonising 14-year trophy drought. Declan Olley West Ham Position: 16th (14 points) Top goalscorers: Michail Antonio, Gianluca Scamacca, Jarrod Bowen and Pablo Fornals (4 goals) Next three PL games: Arsenal (A), Brentford (H), Leeds (A) West Ham return to Premier League action in an unfamiliar position, sitting 16th in the table, after a tricky start to the season. The World Cup break came at a good time for David Moyes, just as pressure was starting to build following three defeats on the bounce. The Scot, who has transformed West Ham's fortunes during his second stint in east London, was let down by underperforming first-team regulars and new-signings struggling to make the transition. Moyes will be hoping the time away from the London Stadium has given his squad a new lease of life. ShareThis is a modal window. Unsupported location The video you are trying to watch cannot be viewed from your current country or location West Ham manager David Moyes says he understands why fans were booing at full-time following his side's defeat to Leicester The outlook is far rosier in Europe for West Ham. They've been without fault in the Europa Conference League, winning all eight of their matches to reach the last 16. Finding a way to replicate that form in the Premier League will be vital to Moyes keeping his job. After spending £179.2m on signings in the summer, it seems unlikely that January will be a busy month for West Ham. It is clear, though, that the squad still needs reinforcements at centre-back, especially with injury concerns surrounding Kurt Zouma and Nayef Aguerd. Sao Paolo defender Luizao is expected to join in January, but is seen as one for the future. Zinny Boswell Wolves Position: 20th (10 points) Top goalscorer: Ruben Neves (4 goals) Next three PL games: Everton (A), Man United (H), Aston Villa (A) Bottom at Christmas, Wolves have had a miserable season so far and if they are to stay in the Premier League it will need new man in charge Julen Lopetegui to be a success. The former Sevilla coach certainly has pedigree but he inherits problems at Molineux. The lowest scorers in the land have an imbalanced squad. Expecting Diego Costa and Raul Jimenez to turn it on up front owes more to faith than reason, while the defence lacks depth and the midfield is better in possession than out of it. There is lots to do. Julen Lopetegui Image: New Wolves Julen Lopetegui is yet to take charge of a match Lopetegui will expect to be supported with new signings but before that he must show that there is a template to take this team away from trouble. The hope is that he has used this period to find solutions on the training ground as well as in the transfer market. Wolves are not yet adrift at the bottom of the table but soon could be. They return to action in the Premier League with a trip to face Everton at Goodison Park - the team just above the relegation zone. A four-point gap could become one or seven. There is no time to lose. Adam Bate"
  },
   {
      "date":"20 Dec, 2022",
    "title":"Transfer Centre LIVE! Diogo Costa could cost Man Utd £65m | N'Golo Kante wants Barcelona move",
    "img":"https://liveblog.digitalimages.sky/lc-images-sky/lcimg-098783be-f5ed-47c2-b4d9-9418e3a8107b.jpeg",
    "body":"Meanwhile, Chelsea midfielder N'Golo Kante wants a pre-contract deal with Barcelona in January, according to reports in Spain.The La Liga giants are said to have held talks with Kante's representatives as they consider a free transfer for the 31-year-old in the summer.Kante's contract at Stamford Bridge expires at the end of the season. The Frenchman has made 262 appearances for Chelsea since joining from Leicester in 2016 but has struggled with injury this campaign."
  },
   {
      "date":"20 Dec, 2022",
    "title":"England complete historic 3-0 series sweep in Pakistan as Ben Duckett ends unbeaten on 82",
    "img":"https://pbs.twimg.com/media/FkZf87ZWAAAZ-fL?format=jpg&name=small",
    "body":"Heading into their first tour of Pakistan for 17 years, England had only beaten the hosts in Test matches twice before on their own turf - and the last of those came in 2000 in the dark in Karachi. Returning to the National Stadium for the final match of this series, Duckett's unbeaten half-century and an opening stand of 87 with Zak Crawley (41) in the evening session on day three had put Stokes' side on the verge of victory. Trending Transfer Centre LIVE! Costa could cost Man Utd £65m | Kante wants Barca move Papers: FIFA president Infantino wants to hold World Cup every three years Redknapp: England didn't have a good WC | Any decent manager could do Southgate's job The Premier League returns: Where did we leave things? England complete historic sweep of Pakistan with comfortable victory Bayern condemn racist abuse towards Coman after WC final Price survives scare at Worlds after Beaton is battered I De Sousa wins thriller 'Messi's football fairytale ends a controversial tournament' - World Cup review Messi's World Cup win confirms his status as the greatest Reaction from England's 3-0 Test series sweep of Pakistan Video Latest News Stokes signalled his intent in the second over of the day when he pulled Mohammad Wasim through midwicket for the first four of the morning, with he and his partner running aggressively between the stumps as well. The duo soon passed the half-century mark for the third wicket, too, although the England captain had a let-off when he was put down on 22 by Agha Salman in the deep off Abrar Ahmed."
  }





]
